bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
struct __attribute__((packed)) PairChallengeV4Pkt {
    uint8_t type;
    uint8_t version;
    uint8_t mode;
    uint8_t mac[6];
    uint8_t channel;
    uint8_t dial_channel;
    uint8_t session_id[PAIRING_SESSION_ID_SIZE];
    uint8_t pubkey[ESPNowCrypto::ECDH_PUBLIC_KEY_SIZE];
    char hostname[ESPNOW_HOSTNAME_SIZE];
};

struct __attribute__((packed)) PairConfirmV4Pkt {
    uint8_t type;
    uint8_t version;
    uint8_t mode;
    uint8_t mac[6];
    uint8_t session_id[PAIRING_SESSION_ID_SIZE];
    uint8_t auth_tag[PAIR_TAG_SIZE];
};

struct __attribute__((packed)) PairResultV4Pkt {
    uint8_t type;
    uint8_t version;
    uint8_t mode;
    uint8_t mac[6];
    uint8_t channel;
    uint8_t session_id[PAIRING_SESSION_ID_SIZE];
    char hostname[ESPNOW_HOSTNAME_SIZE];
    uint8_t auth_tag[PAIR_TAG_SIZE];
};

struct __attribute__((packed)) PairCompleteV4Pkt {
    uint8_t type;
    uint8_t version;
    uint8_t mode;
    uint8_t mac[6];
    uint8_t session_id[PAIRING_SESSION_ID_SIZE];
    uint8_t auth_tag[PAIR_TAG_SIZE];
};

static_assert(sizeof(DiscoveryV4Pkt) == 91, "ESP-NOW v4 discovery layout changed");
static_assert(sizeof(PairChallengeV4Pkt) == 124, "ESP-NOW v4 challenge layout changed");
static_assert(sizeof(PairConfirmV4Pkt) == 41, "ESP-NOW v4 confirmation layout changed");
static_assert(sizeof(PairResultV4Pkt) == 74, "ESP-NOW v4 result layout changed");
static_assert(sizeof(PairCompleteV4Pkt) == 41, "ESP-NOW v4 completion layout changed");


void ESPNowModule::init() {
    static bool commands_registered = false;
    if (!commands_registered) {
        commands_registered = true;
        new UserCommand("EP", "ESPNow/Pair", espnowPairCommand, anyState, WA);
        new UserCommand("EC", "ESPNow/Cancel", espnowCancelCommand, anyState, WA);
        new UserCommand("EL", "ESPNow/List", espnowListCommand, anyState, WA);
        new UserCommand("EU", "ESPNow/Unpair", espnowUnpairCommand, anyState, WA);
    }

    // The Wi-Fi stack is brought up (if needed) by ESPNowChannel::arm(), which
    // runs only when there is a saved pairing or the operator opens a pairing
    // window.  A node with ESP-NOW compiled in but never paired stays dark.
    espnowChannel.init();
}

void ESPNowModule::poll() {
    espnowChannel.poll();
}


ESPNowChannel::ESPNowChannel() : Channel("espnow") {
    _peer_mutex = xSemaphoreCreateRecursiveMutex();
    _instance   = this;
    if (!_peer_mutex) {
        log_error("ESP-NOW: failed to create peer mutex");
    }
}

void ESPNowChannel::init() {
    if (_initialized) {
        return;
    }
    _initialized = true;

    // Registering the channel and its report interval is cheap (no buffers);
    // do it unconditionally so $ESPNow commands and pairing work on demand.
    if (!_registered) {
        allChannels.registration(this);
        _registered = true;
    }
    setReportInterval(ESPNowConfig::DEFAULT_REPORT_INTERVAL_MS);

    // Probe NVS for a saved pairing.  If one exists, come up armed; otherwise
    // stay dark until the operator runs $ESPNow/Pair.
    ESPNowPairingRecord probe[ESPNowConfig::MAX_PAIRINGS];
    size_t              saved = ESPNowConfig::loadPairings(probe, ESPNowConfig::MAX_PAIRINGS);
    ESPNowCrypto::secureZero(probe, sizeof(probe));
    _want_arm = saved > 0;
    if (_want_arm) {
        arm();  // may fail if Wi-Fi is not started yet; poll() retries
    }
}

// Allocate the ESP-NOW runtime: esp_now_init(), the receive callbacks, the
// inbound packet queue, and the saved-pairing roster.  Idempotent.  Returns
// false (leaving the node dark) if Wi-Fi is not ready or allocation fails.
bool ESPNowChannel::arm() {
    if (_espnow_started) {
        return true;
    }
    if (!_peer_mutex) {
        log_error("ESP-NOW: cannot arm without peer mutex");
        return false;
    }

    if (WiFi.getMode() == WIFI_OFF) {
        WiFi.mode(WIFI_STA);
        WiFi.disconnect(false, false);
    }

    esp_err_t init_err = esp_now_init();
    if (init_err != ESP_OK) {
        // ESP_ERR_ESPNOW_INTERNAL here usually means Wi-Fi has not finished
        // starting yet; poll() will retry.  Log at debug so a transient
        // startup race does not spam, but name the actual error so a
        // persistent failure is still diagnosable.
        log_debug("ESP-NOW: esp_now_init() failed: " << esp_err_to_name(init_err) << " (will retry)");
        return false;
    }

    uint8_t pmk[16];
    ESPNowCrypto::derivePmk(pmk);
    esp_now_set_pmk(pmk);
    ESPNowCrypto::secureZero(pmk, sizeof(pmk));

    esp_now_register_recv_cb(ESPNowChannel::onRecv);
    esp_now_register_send_cb(ESPNowChannel::onSent);

    _packet_queue = xQueueCreate(RX_PACKET_QUEUE_DEPTH, sizeof(RxPacket));
    if (!_packet_queue) {
        log_error("ESP-NOW: failed to create packet queue");
        esp_now_unregister_recv_cb();
        esp_now_unregister_send_cb();
        esp_now_deinit();
        return false;
    }

    _espnow_started = true;
    _want_arm       = false;

    ESPNowPairingRecord records[ESPNowConfig::MAX_PAIRINGS];
    size_t              saved_count = ESPNowConfig::loadPairings(records, ESPNowConfig::MAX_PAIRINGS);
    loadRoster(records, saved_count);
    ESPNowCrypto::secureZero(records, sizeof(records));

    if (_paired.load(std::memory_order_acquire)) {
        setActivePeer(0);
    }

    log_debug("ESP-NOW: armed");
    return true;
}

void ESPNowChannel::loadRoster(const ESPNowPairingRecord* records, size_t count) {
    _paired_count.store(0, std::memory_order_release);
    for (size_t i = 0; i < count; ++i) {
        size_t paired_count = _paired_count.load(std::memory_order_acquire);
        if (paired_count >= MAX_SERVER_PAIRINGS) {
            log_error("ESP-NOW: saved pairing roster exceeds runtime capacity");
            break;
        }
        size_t new_index = paired_count;
        memcpy(_paired_peers[new_index].mac, records[i].peer_mac, 6);
        memcpy(_paired_peers[new_index].lmk, records[i].lmk, 16);
        resetPeerRuntime((int)new_index);
        if (registerPeer(_paired_peers[new_index].mac, _paired_peers[new_index].lmk)) {
            _paired_count.store(new_index + 1, std::memory_order_release);
            log_debug("ESP-NOW: loaded saved pairing for " << mac_str(_paired_peers[new_index].mac));
        } else {
            memset(_paired_peers[new_index].mac, 0, sizeof(_paired_peers[new_index].mac));
            memset(_paired_peers[new_index].lmk, 0, sizeof(_paired_peers[new_index].lmk));
            log_error("ESP-NOW: failed to restore saved pairing for " << mac_str(records[i].peer_mac));
        }
    }
    _paired.store(_paired_count.load(std::memory_order_acquire) > 0, std::memory_order_release);
}

// The inbound byte ring (4 kB) is only needed once a peer actually streams
// line data; realtime/keepalive traffic never touches it.
bool ESPNowChannel::ensureRxBuf() {
    if (_rx_buf) {
        return true;
    }
    _rx_buf = static_cast<uint8_t*>(malloc(RX_BUF_SIZE));
    if (!_rx_buf) {
        log_error("ESP-NOW: failed to allocate receive ring");
        return false;
    }
    _rx_head.store(0, std::memory_order_release);
    _rx_tail.store(0, std::memory_order_release);
    return true;
}

// The pairing queues are only exercised while a pairing window is open.  Once
// created they persist for the session (deleting them would race the Wi-Fi
// task recv callback); xQueueReset on close keeps them empty.
void ESPNowChannel::ensurePairingQueues() {
    if (!_pairing_queue) {
        _pairing_queue = xQueueCreate(PAIRING_PACKET_QUEUE_DEPTH, sizeof(RxPacket));
    }
    if (!_pair_confirm_queue) {
        _pair_confirm_queue = xQueueCreate(PAIR_CONFIRM_QUEUE_DEPTH, sizeof(RxPacket));
    }
    if (!_pairing_queue || !_pair_confirm_queue) {
        log_error("ESP-NOW: failed to create pairing queues");
    }
}

