bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
void ESPNowChannel::freeFrag(PairedPeer& peer) {
    if (peer.frag) {
        free(peer.frag);
        peer.frag = nullptr;
    }
}

bool ESPNowChannel::startPairingWindow(uint32_t window_ms) {
    if (!arm()) {
        return false;
    }
    ensurePairingQueues();
    if (!_pairing_queue || !_pair_confirm_queue) {
        return false;
    }

    clearPairingTransaction(true);
    if (_pairing_queue) {
        xQueueReset(_pairing_queue);
    }
    if (_pair_confirm_queue) {
        xQueueReset(_pair_confirm_queue);
    }
    _pairing_window_until_ms.store((uint32_t)millis() + window_ms, std::memory_order_release);
    _pairing_window_active.store(true, std::memory_order_release);
    uint8_t local_mac[6] = {};
    uint8_t channel = espnowCurrentChannel();
    if (espnowLocalMac(local_mac)) {
        log_debug("ESP-NOW: pairing window opened on " << espnowInterfaceName()
                                                        << " channel " << (int)channel
                                                        << " MAC " << mac_str(local_mac));
    } else {
        log_debug("ESP-NOW: pairing window opened on " << espnowInterfaceName()
                                                        << " channel " << (int)channel);
    }
    return true;
}

bool ESPNowChannel::pairingWindowActive() {
    if (!_pairing_window_active.load(std::memory_order_acquire)) {
        return false;
    }
    uint32_t until = _pairing_window_until_ms.load(std::memory_order_acquire);
    if ((int32_t)(until - (uint32_t)millis()) <= 0) {
        _pairing_window_active.store(false, std::memory_order_release);
        clearPairingTransaction(true);
        return false;
    }
    return true;
}

void ESPNowChannel::cancelPairingWindow() {
    _pairing_window_active.store(false, std::memory_order_release);
    _pairing_window_until_ms.store(0, std::memory_order_release);
    clearPairingTransaction(true);
    if (_pairing_queue) {
        xQueueReset(_pairing_queue);
    }
    if (_pair_confirm_queue) {
        xQueueReset(_pair_confirm_queue);
    }
}

bool ESPNowChannel::listPairings(Channel& out) const {
    ESPNowPairingRecord records[ESPNowConfig::MAX_PAIRINGS];
    size_t count = ESPNowConfig::loadPairings(records, ESPNowConfig::MAX_PAIRINGS);
    if (count == 0) {
        log_info_to(out, "ESP-NOW: whitelist is empty");
        return true;
    }

    for (size_t i = 0; i < count; ++i) {
        log_info_to(out, "ESP-NOW: " << (i + 1) << ": " << mac_str(records[i].peer_mac));
    }
    ESPNowCrypto::secureZero(records, sizeof(records));
    return true;
}

bool ESPNowChannel::removeRuntimePeer(const uint8_t* mac) {
    if (!mac) {
        return false;
    }

    PeerStateLock peer_lock(_peer_mutex);
    int index = findPairedPeerIndexLocked(mac);
    if (index < 0) {
        return false;
    }

    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    esp_now_del_peer(_paired_peers[index].mac);
    ESPNowCrypto::secureZero(_paired_peers[index].lmk, sizeof(_paired_peers[index].lmk));

    for (size_t i = (size_t)index; i + 1 < paired_count; ++i) {
        memcpy(_paired_peers[i].mac, _paired_peers[i + 1].mac, sizeof(_paired_peers[i].mac));
        memcpy(_paired_peers[i].lmk, _paired_peers[i + 1].lmk, sizeof(_paired_peers[i].lmk));
        resetPeerRuntimeLocked((int)i);
    }

    size_t last = paired_count - 1;
    memset(_paired_peers[last].mac, 0, sizeof(_paired_peers[last].mac));
    ESPNowCrypto::secureZero(_paired_peers[last].lmk, sizeof(_paired_peers[last].lmk));
    resetPeerRuntimeLocked((int)last);

    _paired_count.store(last, std::memory_order_release);
    _paired.store(last > 0, std::memory_order_release);
    if (last == 0) {
        _want_arm = false;  // roster empty: cancel any pending arm() retry
    }
    int active = _active_peer_index.load(std::memory_order_acquire);
    if (active == index || active >= (int)last) {
        _active_peer_index.store(last > 0 ? 0 : -1, std::memory_order_release);
    }
    refreshReportInterval();
    return true;
}

bool ESPNowChannel::removePairingIndex(size_t one_based_index, uint8_t removed_mac[6]) {
    if (!ESPNowConfig::removePairingIndex(one_based_index, removed_mac)) {
        return false;
    }
    removeRuntimePeer(removed_mac);
    return true;
}

void ESPNowChannel::clearPairings() {
    clearPairingTransaction(true);
    if (_pairing_queue) {
        xQueueReset(_pairing_queue);
    }
    if (_pair_confirm_queue) {
        xQueueReset(_pair_confirm_queue);
    }

    PeerStateLock peer_lock(_peer_mutex);
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    for (size_t i = 0; i < paired_count; ++i) {
        esp_now_del_peer(_paired_peers[i].mac);
        memset(_paired_peers[i].mac, 0, sizeof(_paired_peers[i].mac));
        ESPNowCrypto::secureZero(_paired_peers[i].lmk, sizeof(_paired_peers[i].lmk));
        resetPeerRuntimeLocked((int)i);
    }
    _paired_count.store(0, std::memory_order_release);
    _paired.store(false, std::memory_order_release);
    _active_peer_index.store(-1, std::memory_order_release);
    _pairing_window_active.store(false, std::memory_order_release);
    // Cancel any pending arm() retry so a node whose roster was cleared before
    // Wi-Fi came up stays dark.  An already-armed node stays armed (harmless).
    _want_arm = false;
    ESPNowConfig::clearPairing();
    refreshReportInterval();
}

int ESPNowChannel::findPairedPeerIndex(const uint8_t* mac, TickType_t timeout) const {
    PeerStateLock peer_lock(_peer_mutex, timeout);
    if (!peer_lock.locked() || !mac) {
        return -1;
    }
    return findPairedPeerIndexLocked(mac);
}

int ESPNowChannel::findPairedPeerIndexLocked(const uint8_t* mac) const {
    if (!mac) {
        return -1;
    }
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    for (size_t i = 0; i < paired_count; ++i) {
        if (memcmp(_paired_peers[i].mac, mac, 6) == 0) {
            return (int)i;
        }
    }
    return -1;
}

bool ESPNowChannel::peerConnected(int index) const {
    PeerStateLock peer_lock(_peer_mutex);
    return peerConnectedLocked(index, (uint32_t)millis());
}

bool ESPNowChannel::peerConnectedLocked(int index, uint32_t now) const {
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    if (index < 0 || index >= (int)paired_count) {
        return false;
    }
    const auto& peer = _paired_peers[index];
    if (peer.session_state.load(std::memory_order_acquire) !=
        PeerSessionState::Connected) {
        return false;
    }
    uint32_t last_rx_ms = peer.last_rx_ms.load(std::memory_order_acquire);
    if (last_rx_ms == 0) {
        return false;
    }
    return (uint32_t)(now - last_rx_ms) <= PENDANT_IDLE_TIMEOUT_MS;
}

void ESPNowChannel::refreshReportInterval() {
    setReportInterval(ESPNowConfig::DEFAULT_REPORT_INTERVAL_MS);
}

void ESPNowChannel::resetPeerRuntime(int index) {
    PeerStateLock peer_lock(_peer_mutex);
    resetPeerRuntimeLocked(index);
}

void ESPNowChannel::resetPeerRuntimeLocked(int index) {
    if (index < 0 || index >= (int)MAX_SERVER_PAIRINGS) {
        return;
    }

    auto& peer = _paired_peers[index];
    peer.tx_peer_known.store(false, std::memory_order_release);
    peer.session_state.store(PeerSessionState::Synchronizing, std::memory_order_release);
    peer.tx_peer_nonce.store(0, std::memory_order_release);
    peer.tx_counter.store(0, std::memory_order_release);
    peer.last_rx_ms.store(0, std::memory_order_release);
    peer.last_control_ms.store(0, std::memory_order_release);
    peer.echo_pending.store(false, std::memory_order_release);
    ESPNowCrypto::issueRxChallenge(peer.rx_nonce);
    peer.rx_replay = {};
    peer.motion_barrier_counter = 0;
    freeFrag(peer);
    peer.tx_seq = 0;
}

bool ESPNowChannel::notePeerAuthenticatedLocked(int index, bool control_activity, uint32_t now) {
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    if (index < 0 || index >= (int)paired_count) {
        return false;
    }

    auto& peer = _paired_peers[index];
    bool became_connected =
        peer.session_state.load(std::memory_order_acquire) !=
        PeerSessionState::Connected;

    peer.session_state.store(PeerSessionState::Connected, std::memory_order_release);
    peer.last_rx_ms.store(now, std::memory_order_release);
    if (control_activity) {
        peer.last_control_ms.store(now, std::memory_order_release);
    }
    if (became_connected) {
        log_info("ESP-NOW: peripheral connected " << mac_str(peer.mac));
    }
    return became_connected;
}

bool ESPNowChannel::dataMessageClaimsControl(const PairedPeer& peer) const {
    char line[8] = {};
    size_t line_len = 0;
    bool started = false;

    if (!peer.frag) {
        return false;
    }
    for (uint8_t frag = 0; frag < peer.frag->total && frag < MAX_FRAGS; ++frag) {
        for (uint16_t i = 0; i < peer.frag->sizes[frag]; ++i) {
            char c = (char)peer.frag->data[frag][i];
            if (!started) {
                if (c == ' ' || c == '\t' || c == '\r' || c == '\n') {
                    continue;
                }
                started = true;
            }
            if (c == '\r' || c == '\n') {
                return lineStartsWith(line, "$J=");
            }
            if (line_len + 1 < sizeof(line)) {
                line[line_len++] = c;
            }
            if (line_len >= 3) {
                return lineStartsWith(line, "$J=");
            }
        }
    }

