bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
    return lineStartsWith(line, "$J=");
}

bool ESPNowChannel::setActivePeer(int index) {
    PeerStateLock peer_lock(_peer_mutex);
    return setActivePeerLocked(index);
}

bool ESPNowChannel::setActivePeerLocked(int index) {
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    if (index < 0 || index >= (int)paired_count) {
        return false;
    }
    if (_active_peer_index.load(std::memory_order_acquire) == index) {
        return true;
    }

    _active_peer_index.store(index, std::memory_order_release);
    refreshReportInterval();
    log_debug("ESP-NOW: active peripheral " << mac_str(_paired_peers[index].mac));
    return true;
}

bool ESPNowChannel::canSwitchActivePeerLocked(uint32_t now) const {
    int active_peer_index = _active_peer_index.load(std::memory_order_acquire);
    if (active_peer_index < 0) {
        return true;
    }
    if (!peerConnectedLocked(active_peer_index, now)) {
        return true;
    }
    uint32_t last = _paired_peers[active_peer_index].last_control_ms.load(std::memory_order_acquire);
    return last == 0 || (uint32_t)(now - last) > PENDANT_IDLE_TIMEOUT_MS;
}

bool ESPNowChannel::claimControlLeaseLocked(int index, uint32_t now) {
    return claimControlLeaseLocked(index, now, false);
}

bool ESPNowChannel::claimControlLeaseLocked(int index, uint32_t now, bool force) {
    if (index == _active_peer_index.load(std::memory_order_acquire)) {
        return true;
    }
    if (force) {
        return setActivePeerLocked(index);
    }
    if (!canSwitchActivePeerLocked(now)) {
        return false;
    }
    return setActivePeerLocked(index);
}

void ESPNowChannel::restorePairedPeerOrDelete(const uint8_t* mac) {
    uint8_t lmk[16] = {};
    bool found = false;
    {
        PeerStateLock peer_lock(_peer_mutex);
        int index = findPairedPeerIndexLocked(mac);
        if (index >= 0) {
            memcpy(lmk, _paired_peers[index].lmk, sizeof(lmk));
            found = true;
        }
    }

    if (found) {
        if (!registerPeer(mac, lmk)) {
            log_error("ESP-NOW: failed to restore encrypted peer " << mac_str(mac));
        }
    } else {
        esp_now_del_peer(mac);
    }
    ESPNowCrypto::secureZero(lmk, sizeof(lmk));
}

void ESPNowChannel::clearPairingTransaction(bool restore_peer) {
    uint8_t mac[6] = {};
    bool had_peer = _pairing.state != PairingState::Idle;
    if (had_peer) {
        memcpy(mac, _pairing.mac, sizeof(mac));
    }
    _pairing_challenge_waiting.store(false, std::memory_order_release);
    ESPNowCrypto::secureZero(&_pairing, sizeof(_pairing));
    _pairing.state = PairingState::Idle;
    if (restore_peer && had_peer) {
        restorePairedPeerOrDelete(mac);
    }
}

bool ESPNowChannel::registerPeer(const uint8_t* mac, const uint8_t* lmk) {
    esp_now_del_peer(mac);

    esp_now_peer_info_t peer = {};
    memcpy(peer.peer_addr, mac, 6);
    memcpy(peer.lmk, lmk, 16);
    peer.encrypt  = true;
    peer.channel  = 0;
    peer.ifidx    = espnowInterface();

    return esp_now_add_peer(&peer) == ESP_OK;
}

bool ESPNowChannel::activatePairing() {
    int paired_index = -1;
    bool new_peer = false;
    bool activation_failed = false;
    {
        PeerStateLock peer_lock(_peer_mutex);
        size_t paired_count = _paired_count.load(std::memory_order_acquire);
        for (size_t i = 0; i < paired_count; ++i) {
            if (memcmp(_paired_peers[i].mac, _pairing.mac, 6) == 0) {
                paired_index = (int)i;
                break;
            }
        }

        new_peer = paired_index < 0;
        if (new_peer) {
            if (paired_count >= MAX_SERVER_PAIRINGS) {
                log_error("ESP-NOW: pairing roster filled before activation");
                activation_failed = true;
            } else {
                paired_index = (int)paired_count;
            }
        }

        if (!activation_failed &&
            !registerPeer(_pairing.mac, _pairing.lmk)) {
            log_error("ESP-NOW: failed to enable encrypted peer for " << mac_str(_pairing.mac));
            activation_failed = true;
        }

        if (!activation_failed) {
            memcpy(_paired_peers[paired_index].mac, _pairing.mac, 6);
            memcpy(_paired_peers[paired_index].lmk, _pairing.lmk, 16);
            resetPeerRuntimeLocked(paired_index);
            if (new_peer) {
                _paired_count.store((size_t)paired_index + 1, std::memory_order_release);
            }
            _paired.store(true, std::memory_order_release);
        }
    }

    if (activation_failed) {
        return false;
    }

    if (!ESPNowConfig::savePairing(_pairing.mac, _pairing.lmk)) {
        log_error("ESP-NOW: failed to persist pairing for " << mac_str(_pairing.mac));
    }
    if (_active_peer_index.load(std::memory_order_acquire) < 0) {
        setActivePeer(paired_index);
    }
    refreshReportInterval();
    log_debug("ESP-NOW: pairing activated for " << mac_str(_pairing.mac));
    return true;
}

void ESPNowChannel::processPairingTransaction() {
    if (_pairing.state == PairingState::Idle) {
        return;
    }

    uint32_t now = (uint32_t)millis();
    if (_pairing.state == PairingState::AwaitConfirm) {
        if ((uint32_t)(now - _pairing.last_ms) > PAIRING_HANDSHAKE_TIMEOUT_MS) {
            clearPairingTransaction(true);
        }
        return;
    }

    if (_pairing.state == PairingState::ReadyResult) {
        if (_pairing_challenge_waiting.load(std::memory_order_acquire) &&
            (uint32_t)(now - _pairing.last_ms) <= SEND_CALLBACK_TIMEOUT_MS) {
            return;
        }
        _pairing_challenge_waiting.store(false, std::memory_order_release);
        if (_pairing.send_attempts > 0 &&
            (uint32_t)(now - _pairing.last_ms) < PAIRING_RESULT_RETRY_MS) {
            return;
        }
        ++_pairing.send_attempts;
        _pairing.last_ms = now;
        if (esp_now_send(_pairing.mac, _pairing.result, _pairing.result_len) != ESP_OK) {
            if (_pairing.send_attempts >= 3) {
                log_error("ESP-NOW: failed to queue pairing result for " << mac_str(_pairing.mac));
                clearPairingTransaction(true);
            }
            return;
        }
        _pairing.state = PairingState::AwaitComplete;
        log_debug("ESP-NOW: pairing result queued; awaiting peripheral completion");
        return;
    }

    if (_pairing.state == PairingState::AwaitComplete) {
        if ((uint32_t)(now - _pairing.started_ms) > PAIRING_HANDSHAKE_TIMEOUT_MS) {
            clearPairingTransaction(true);
            return;
        }
        if ((uint32_t)(now - _pairing.last_ms) >= PAIRING_RESULT_RETRY_MS) {
            _pairing.last_ms = now;
            esp_now_send(_pairing.mac, _pairing.result, _pairing.result_len);
        }
        return;
    }
}


size_t ESPNowChannel::write(uint8_t c) {
    return write(&c, 1);
}

