bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
size_t ESPNowChannel::write(const uint8_t* buf, size_t size) {
    if (!_paired.load(std::memory_order_acquire) || size == 0) {
        return size;
    }

    bool has_connected_peer = false;
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    for (size_t i = 0; i < paired_count; ++i) {
        if (peerConnected((int)i)) {
            has_connected_peer = true;
            break;
        }
    }
    if (!has_connected_peer) {
        return size;
    }

    size_t offset = 0;
    while (offset < size) {
        size_t room = TX_FLUSH_THRESHOLD - _tx_buf.size();
        size_t remaining = size - offset;
        size_t chunk = room < remaining ? room : remaining;
        _tx_buf.append(reinterpret_cast<const char*>(buf + offset), chunk);
        offset += chunk;

        if ((!_tx_buf.empty() && _tx_buf.back() == '\n') ||
            _tx_buf.size() == TX_FLUSH_THRESHOLD) {
            sendFragmented(reinterpret_cast<const uint8_t*>(_tx_buf.data()), _tx_buf.size());
            _tx_buf.clear();
        }
    }

    return size;
}

void ESPNowChannel::sendFragmented(const uint8_t* data, size_t len) {
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    uint32_t now = (uint32_t)millis();
    for (size_t i = 0; i < paired_count; ++i) {
        PeerStateLock peer_lock(_peer_mutex);
        if (i >= _paired_count.load(std::memory_order_acquire) ||
            !peerConnectedLocked((int)i, now)) {
            continue;
        }
        sendFragmentedToPeer(_paired_peers[i], data, len);
    }
}

void ESPNowChannel::sendFragmentedToPeer(PairedPeer& peer, const uint8_t* data, size_t len) {
    uint8_t total_frags = (uint8_t)((len + MAX_FRAG_DATA - 1) / MAX_FRAG_DATA);
    if (total_frags == 0) {
        total_frags = 1;
    }
    if (total_frags > MAX_FRAGS) {
        log_error("ESP-NOW: outgoing message (" << len << " B) exceeds max fragmented size — truncating");
        total_frags = MAX_FRAGS;
        len         = MAX_FRAGS * MAX_FRAG_DATA;
    }

    uint8_t  seq = peer.tx_seq++;
    uint8_t  pkt[MAX_ESP_PAYLOAD];
    size_t   offset = 0;

    for (uint8_t i = 0; i < total_frags; i++) {
        size_t chunk = len - offset;
        if (chunk > MAX_FRAG_DATA) {
            chunk = MAX_FRAG_DATA;
        }

        pkt[0] = PKT_DATA;
        if (!ESPNowCrypto::stampAntiReplayTag(peer.tx_peer_known, peer.tx_peer_nonce, peer.tx_counter, pkt + 1)) {
            return;
        }
        pkt[9]  = seq;          // 1 + ART_TAG_SIZE
        pkt[10] = i;
        pkt[11] = total_frags;
        memcpy(pkt + FRAG_HDR_SIZE, data + offset, chunk);

        esp_now_send(peer.mac, pkt, FRAG_HDR_SIZE + chunk);
        offset += chunk;
    }
}


void ESPNowChannel::rxPush(uint8_t byte) {
    if (!_rx_buf) {
        return;
    }
    int cur  = _rx_head.load(std::memory_order_relaxed);
    int next = (cur + 1) % RX_BUF_SIZE;
    if (next == _rx_tail.load(std::memory_order_acquire)) {
        return;  // buffer full — drop
    }
    _rx_buf[cur] = byte;
    _rx_head.store(next, std::memory_order_release);
}

size_t ESPNowChannel::rxBuffered() const {
    if (!_rx_buf) {
        return 0;
    }
    int head = _rx_head.load(std::memory_order_acquire);
    int tail = _rx_tail.load(std::memory_order_acquire);
    if (head >= tail) {
        return (size_t)(head - tail);
    }
    return RX_BUF_SIZE - (size_t)(tail - head);
}

size_t ESPNowChannel::rxFree() const {
    if (!_rx_buf) {
        return 0;
    }
    // One slot is kept empty to distinguish a full ring from an empty one.
    return RX_BUF_SIZE - 1 - rxBuffered();
}

void ESPNowChannel::poll() {
    if (_want_arm && !_espnow_started) {
        arm();  // Wi-Fi may not have been ready at init() time
    }
    if (!_espnow_started) {
        return;  // dark: no queues, no peers, nothing to service
    }

    processPairingTransaction();
    uint32_t now = (uint32_t)millis();

    RxPacket packet;
    size_t processed = 0;
    while (_packet_queue &&
           processed < MAX_RX_PACKETS_PER_POLL &&
           xQueueReceive(_packet_queue, &packet, 0) == pdTRUE) {
        processPacket(packet);
        ++processed;
    }

    // A confirmation consumes the ECDH state created by discovery, so it must
    // run before another queued discovery can replace that state.
    while (_pair_confirm_queue &&
           xQueueReceive(_pair_confirm_queue, &packet, 0) == pdTRUE) {
        processPacket(packet);
    }

    // Pairing may perform ECDH. Process @ most 1 pairing packet per pass
    if (_pairing_queue &&
        (uint32_t)(now - _last_pairing_packet_ms) >= PAIRING_PACKET_INTERVAL_MS &&
        xQueueReceive(_pairing_queue, &packet, 0) == pdTRUE) {
        _last_pairing_packet_ms = now;
        processPacket(packet);
    }

    now = (uint32_t)millis();

    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    for (size_t i = 0; i < paired_count; ++i) {
        uint8_t reply[AUTH_KEEPALIVE_SIZE];
        size_t reply_len = 0;
        uint8_t peer_mac[6] = {};
        bool refresh_interval = false;

        {
            PeerStateLock peer_lock(_peer_mutex);
            if (i >= _paired_count.load(std::memory_order_acquire)) {
                break;
            }
            auto& peer = _paired_peers[i];
            bool timed_out =
                peer.session_state.load(std::memory_order_acquire) ==
                    PeerSessionState::Connected &&
                !peerConnectedLocked((int)i, now);

            if (timed_out) {
                log_info("ESP-NOW: peripheral disconnected " << mac_str(peer.mac));
                resetPeerRuntimeLocked((int)i);
                if (_active_peer_index.load(std::memory_order_acquire) == (int)i) {
                    _active_peer_index.store(-1, std::memory_order_release);
                }
                refresh_interval = true;
            }

            if (peer.echo_pending.exchange(false, std::memory_order_acq_rel)) {
                uint32_t advertised = peer.rx_nonce.load(std::memory_order_acquire);
                memcpy(peer_mac, peer.mac, sizeof(peer_mac));
                reply[0] = PKT_KEEPALIVE;
                memcpy(reply + 1, &advertised, 4);

                if (!peer.tx_peer_known.load(std::memory_order_acquire)) {
                    reply_len = 5;
                } else if (ESPNowCrypto::stampAntiReplayTag(
                               peer.tx_peer_known,
                               peer.tx_peer_nonce,
                               peer.tx_counter,
                               reply + 5)) {
                    reply[1 + 4 + ART_TAG_SIZE] =
                        peer.session_state.load(std::memory_order_acquire) ==
                                PeerSessionState::Connected
                            ? KEEPALIVE_SESSION_CONFIRMED
                            : 0;
                    reply_len = sizeof(reply);
                }
            }
        }

        if (refresh_interval) {
            refreshReportInterval();
        }
        if (reply_len != 0) {
            esp_now_send(peer_mac, reply, reply_len);
        }
    }

