bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
}

int ESPNowChannel::available() {
    return (int)(queued_bytes() + rxBuffered());
}

int ESPNowChannel::read() {
    if (!_rx_buf) {
        return -1;
    }
    int tail = _rx_tail.load(std::memory_order_relaxed);
    if (tail == _rx_head.load(std::memory_order_acquire)) {
        return -1;
    }

    uint8_t byte = _rx_buf[tail];
    _rx_tail.store((tail + 1) % RX_BUF_SIZE, std::memory_order_release);
    return byte;
}

int ESPNowChannel::peek() {
    if (!_rx_buf) {
        return -1;
    }
    int tail = _rx_tail.load(std::memory_order_acquire);
    if (tail == _rx_head.load(std::memory_order_acquire)) {
        return -1;
    }
    return _rx_buf[tail];
}

int ESPNowChannel::rx_buffer_available() {
    size_t pending = queued_bytes() + rxBuffered();
    return pending < 256 ? 256 - (int)pending : 0;
}

Error ESPNowChannel::pollLine(char* line) {
    if (!line) {
        // PKT_REALTIME is processed directly by handleRealtime().  Don't read
        // ordinary data here: Channel::pollLine(nullptr) would move it into the
        // heap-backed Channel queue while an SD/macro job is active.
        handle();
        if (_active) {
            autoReport();
        }
        return Error::NoData;
    }
    return Channel::pollLine(line);
}

void ESPNowChannel::flushRx() {
    _rx_tail.store(_rx_head.load(std::memory_order_acquire), std::memory_order_release);
    Channel::flushRx();

    PeerStateLock peer_lock(_peer_mutex);
    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    for (size_t i = 0; i < paired_count; ++i) {
        freeFrag(_paired_peers[i]);
    }
}

void ESPNowChannel::processPacket(const RxPacket& packet) {
    if (packet.len == 0 || packet.len > MAX_ESP_PAYLOAD) {
        return;
    }

    uint8_t pkt_type = packet.data[0];
    if (pkt_type == PKT_DISCOVERY) {
        handleDiscovery(packet.src, packet.data, packet.len);
        return;
    }
    if (pkt_type == PKT_PAIR_CONFIRM) {
        handlePairConfirm(packet.src, packet.data, packet.len);
        return;
    }
    if (pkt_type == PKT_PAIR_COMPLETE) {
        handlePairComplete(packet.src, packet.data, packet.len);
        return;
    }

    if (!_paired.load(std::memory_order_acquire)) {
        return;
    }
    int paired_index = findPairedPeerIndex(packet.src);
    if (paired_index < 0) {
        return;
    }

    switch (pkt_type) {
        case PKT_DATA:
            handleData(paired_index, packet.data, packet.len);
            break;
        case PKT_REALTIME:
            handleRealtime(paired_index, packet.data, packet.len);
            break;
        case PKT_KEEPALIVE:
            handleKeepalive(paired_index, packet.data, packet.len);
            break;
        default:
            break;
    }
}

#if ESP_IDF_VERSION_MAJOR >= 5
void ESPNowChannel::onRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
    const uint8_t* src = info ? info->src_addr : nullptr;
#else
void ESPNowChannel::onRecv(const uint8_t* src, const uint8_t* data, int len) {
#endif
    if (!_instance || !src || !data || len < 1 || len > MAX_ESP_PAYLOAD) {
        return;
    }
    uint8_t pkt_type = data[0];
    QueueHandle_t queue = nullptr;
    switch (pkt_type) {
        case PKT_DISCOVERY:
            if (len == (int)sizeof(DiscoveryV4Pkt) &&
                _instance->_pairing_window_active.load(std::memory_order_acquire)) {
                queue = _instance->_pairing_queue;
            }
            break;
        case PKT_PAIR_CONFIRM:
            if (len == (int)sizeof(PairConfirmV4Pkt) &&
                _instance->_pairing_window_active.load(std::memory_order_acquire)) {
                queue = _instance->_pair_confirm_queue;
            }
            break;
        case PKT_PAIR_COMPLETE:
            if (len == (int)sizeof(PairCompleteV4Pkt) &&
                _instance->_pairing_window_active.load(std::memory_order_acquire)) {
                queue = _instance->_pair_confirm_queue;
            }
            break;
        case PKT_DATA:
            if (len >= FRAG_HDR_SIZE && _instance->_paired.load(std::memory_order_acquire)) {
                queue = _instance->_packet_queue;
            }
            break;
        case PKT_REALTIME:
            if (len == 1 + ART_TAG_SIZE + 1 && _instance->_paired.load(std::memory_order_acquire)) {
                queue = _instance->_packet_queue;
            }
            break;
        case PKT_KEEPALIVE:
            if ((len == 5 || len == (int)AUTH_KEEPALIVE_SIZE) &&
                _instance->_paired.load(std::memory_order_acquire)) {
                queue = _instance->_packet_queue;
            }
            break;
        default:
            break;
    }

    if (!queue) {
        return;
    }

    RxPacket packet = {};
    memcpy(packet.src, src, sizeof(packet.src));
    packet.len = (uint16_t)len;
    memcpy(packet.data, data, (size_t)len);

    bool safety_realtime = false;
    if (pkt_type == PKT_REALTIME) {
        Cmd command = static_cast<Cmd>(data[1 + ART_TAG_SIZE]);
        safety_realtime = espnowRealtimeIsSafety(command);
    }

    if (!safety_realtime) {
        xQueueSend(queue, &packet, 0);
        return;
    }

    // Safety controls shall not sit behind queued jog traffic. Send to front of queue!
    if (xQueueSendToFront(queue, &packet, 0) != pdTRUE) {
        RxPacket discarded;
        if (xQueueReceive(queue, &discarded, 0) == pdTRUE) {
            xQueueSendToFront(queue, &packet, 0);
        }
    }
}


void ESPNowChannel::handleDiscovery(const uint8_t* src_mac, const uint8_t* data, int len) {
    if (!pairingWindowActive()) {
        return;
    }
    if (len != (int)sizeof(DiscoveryV4Pkt) || !src_mac) {
        return;
    }

    DiscoveryV4Pkt pkt;
    memcpy(&pkt, data, sizeof(pkt));
    if (pkt.type != PKT_DISCOVERY ||
        pkt.version != PAIRING_PROTO_V4 ||
        pkt.mode != PAIRING_MODE_PAIR ||
        !mac_eq(src_mac, pkt.mac)) {
        return;
    }

    static const uint8_t zero_session[PAIRING_SESSION_ID_SIZE] = {};
    if (ESPNowCrypto::constantTimeEquals(
            pkt.session_id, zero_session, sizeof(pkt.session_id)) ||
        pkt.channel < 1 ||
        pkt.channel > 14 ||
        pkt.pubkey[0] != 0x04) {
        return;
    }

    if (_pairing.state != PairingState::Idle) {
        bool same_transaction =
            mac_eq(_pairing.mac, pkt.mac) &&
            ESPNowCrypto::constantTimeEquals(
                _pairing.session_id, pkt.session_id, sizeof(pkt.session_id));
        if (same_transaction && _pairing.state == PairingState::AwaitConfirm) {
            _pairing.last_ms = (uint32_t)millis();
            if (!_pairing_challenge_waiting.load(std::memory_order_acquire)) {
                _pairing_challenge_waiting.store(true, std::memory_order_release);
                if (esp_now_send(_pairing.mac, _pairing.challenge, _pairing.challenge_len) != ESP_OK) {
                    _pairing_challenge_waiting.store(false, std::memory_order_release);
                }
            }
        }
        return;
    }

    {
        PeerStateLock peer_lock(_peer_mutex);
        int existing_index = findPairedPeerIndexLocked(pkt.mac);
        size_t paired_count = _paired_count.load(std::memory_order_acquire);
        if (existing_index < 0 && paired_count >= MAX_SERVER_PAIRINGS) {
            log_error("ESP-NOW: pairing roster full, rejecting new peripheral " << mac_str(pkt.mac));
            return;
        }
        if (existing_index >= 0 && peerConnectedLocked(existing_index, (uint32_t)millis())) {
            log_error("ESP-NOW: rejecting re-pair attempt from active peripheral " << mac_str(pkt.mac));
            return;
        }
    }

    uint8_t our_mac[6] = {};
    if (!espnowLocalMac(our_mac)) {
        log_error("ESP-NOW: failed to read " << espnowInterfaceName() << " MAC");
        return;
    }
    PairChallengeV4Pkt challenge = {};
    challenge.type = PKT_PAIR_CHALLENGE;
    challenge.version = PAIRING_PROTO_V4;
    challenge.mode = PAIRING_MODE_PAIR;
    memcpy(challenge.mac, our_mac, sizeof(challenge.mac));
    challenge.channel = espnowCurrentChannel();
    challenge.dial_channel = pkt.channel;
    memcpy(challenge.session_id, pkt.session_id, sizeof(challenge.session_id));
    copyHostname(challenge.hostname);

