bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
    uint8_t private_key[ESPNowCrypto::ECDH_PRIVATE_KEY_SIZE] = {};
    if (challenge.channel < 1 || challenge.channel > 14 ||
        !ESPNowCrypto::generateEcdhKeypair(private_key, challenge.pubkey)) {
        ESPNowCrypto::secureZero(private_key, sizeof(private_key));
        clearPairingTransaction(false);
        return;
    }

    uint8_t shared_secret[ESPNowCrypto::ECDH_SHARED_SECRET_SIZE] = {};
    uint8_t window_lmk[16] = {};
    bool derived =
        ESPNowCrypto::deriveEcdhSharedSecret(
            private_key, pkt.pubkey, shared_secret);
    if (derived) {
        ESPNowCrypto::derivePairingWindowLmk(window_lmk);
        ESPNowCrypto::derivePairingSessionLmk(
            window_lmk,
            shared_secret,
            reinterpret_cast<const uint8_t*>(&pkt),
            sizeof(pkt),
            reinterpret_cast<const uint8_t*>(&challenge),
            sizeof(challenge),
            _pairing.lmk);
    }
    ESPNowCrypto::secureZero(private_key, sizeof(private_key));
    ESPNowCrypto::secureZero(shared_secret, sizeof(shared_secret));
    ESPNowCrypto::secureZero(window_lmk, sizeof(window_lmk));
    if (!derived) {
        clearPairingTransaction(false);
        return;
    }

    memcpy(_pairing.mac, pkt.mac, sizeof(_pairing.mac));
    memcpy(_pairing.session_id, pkt.session_id, sizeof(_pairing.session_id));
    memcpy(_pairing.challenge, &challenge, sizeof(challenge));
    _pairing.challenge_len = sizeof(challenge);
    _pairing.started_ms = (uint32_t)millis();
    _pairing.last_ms = _pairing.started_ms;
    _pairing.state = PairingState::AwaitConfirm;
    memcpy(_pairing_callback_mac, pkt.mac, sizeof(_pairing_callback_mac));

    esp_now_del_peer(pkt.mac);
    esp_now_peer_info_t peer = {};
    memcpy(peer.peer_addr, pkt.mac, 6);
    peer.encrypt = false;
    peer.channel = 0;
    peer.ifidx   = espnowInterface();
    if (esp_now_add_peer(&peer) == ESP_OK) {
        _pairing_challenge_waiting.store(true, std::memory_order_release);
        if (esp_now_send(pkt.mac, reinterpret_cast<const uint8_t*>(&challenge), sizeof(challenge)) == ESP_OK) {
            log_debug("ESP-NOW: discovery v4 challenge sent to " << mac_str(pkt.mac));
        } else {
            _pairing_challenge_waiting.store(false, std::memory_order_release);
            clearPairingTransaction(true);
            log_error("ESP-NOW: failed to queue pairing challenge");
        }
    } else {
        clearPairingTransaction(true);
        log_error("ESP-NOW: failed to add peripheral peer for pairing challenge");
    }

    ESPNowCrypto::secureZero(&challenge, sizeof(challenge));
}

void ESPNowChannel::handlePairConfirm(const uint8_t* src_mac, const uint8_t* data, int len) {
    if (!pairingWindowActive()) {
        return;
    }
    if (len != (int)sizeof(PairConfirmV4Pkt) || !src_mac) {
        return;
    }

    PairConfirmV4Pkt pkt;
    memcpy(&pkt, data, sizeof(pkt));
    if (pkt.type != PKT_PAIR_CONFIRM ||
        pkt.version != PAIRING_PROTO_V4 ||
        pkt.mode != PAIRING_MODE_PAIR ||
        !mac_eq(src_mac, pkt.mac) ||
        !mac_eq(_pairing.mac, pkt.mac) ||
        !ESPNowCrypto::constantTimeEquals(
            _pairing.session_id, pkt.session_id, sizeof(pkt.session_id))) {
        return;
    }

    if (_pairing.state != PairingState::AwaitConfirm) {
        return;
    }

    if (!ESPNowCrypto::verifyPairingAuthTag(
            _pairing.lmk,
            reinterpret_cast<const uint8_t*>(&pkt),
            offsetof(PairConfirmV4Pkt, auth_tag),
            pkt.auth_tag)) {
        log_info("ESP-NOW: pairing v4 confirmation failed from " << mac_str(pkt.mac));
        return;
    }

    uint8_t our_mac[6] = {};
    if (!espnowLocalMac(our_mac)) {
        log_error("ESP-NOW: failed to read " << espnowInterfaceName() << " MAC");
        clearPairingTransaction(true);
        return;
    }
    PairResultV4Pkt result = {};
    result.type = PKT_PAIR_RESULT;
    result.version = PAIRING_PROTO_V4;
    result.mode = PAIRING_MODE_PAIR;
    memcpy(result.mac, our_mac, sizeof(result.mac));
    result.channel = espnowCurrentChannel();
    memcpy(result.session_id, pkt.session_id, sizeof(result.session_id));
    copyHostname(result.hostname);
    ESPNowCrypto::pairingAuthTag(
        _pairing.lmk,
        reinterpret_cast<const uint8_t*>(&result),
        offsetof(PairResultV4Pkt, auth_tag),
        result.auth_tag);

    memcpy(_pairing.result, &result, sizeof(result));
    _pairing.result_len = sizeof(result);
    _pairing.last_ms = (uint32_t)millis();
    _pairing.state = PairingState::ReadyResult;
    ESPNowCrypto::secureZero(&result, sizeof(result));
}

void ESPNowChannel::handlePairComplete(const uint8_t* src_mac, const uint8_t* data, int len) {
    if (!pairingWindowActive() ||
        _pairing.state != PairingState::AwaitComplete ||
        len != (int)sizeof(PairCompleteV4Pkt) ||
        !src_mac) {
        return;
    }

    PairCompleteV4Pkt pkt;
    memcpy(&pkt, data, sizeof(pkt));
    bool valid =
        pkt.type == PKT_PAIR_COMPLETE &&
        pkt.version == PAIRING_PROTO_V4 &&
        pkt.mode == PAIRING_MODE_PAIR &&
        mac_eq(src_mac, pkt.mac) &&
        mac_eq(_pairing.mac, pkt.mac) &&
        ESPNowCrypto::constantTimeEquals(
            _pairing.session_id, pkt.session_id, sizeof(pkt.session_id)) &&
        ESPNowCrypto::verifyPairingAuthTag(
            _pairing.lmk,
            reinterpret_cast<const uint8_t*>(&pkt),
            offsetof(PairCompleteV4Pkt, auth_tag),
            pkt.auth_tag);
    ESPNowCrypto::secureZero(&pkt, sizeof(pkt));
    if (!valid) {
        return;
    }

    if (!activatePairing()) {
        clearPairingTransaction(true);
        return;
    }

    _pairing_window_active.store(false, std::memory_order_release);
    log_info("ESP-NOW: paired peripheral " << mac_str(_pairing.mac));
    clearPairingTransaction(false);
}

void ESPNowChannel::handleKeepalive(int peer_index, const uint8_t* data, int len) {
    bool became_authenticated = false;
    bool session_reset = false;

    {
        PeerStateLock peer_lock(_peer_mutex);
        size_t paired_count = _paired_count.load(std::memory_order_acquire);
        if (peer_index < 0 || peer_index >= (int)paired_count) {
            return;
        }

