bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
        auto& peer = _paired_peers[peer_index];
        bool accepted = false;
        bool authenticated = false;

        if (len == (int)AUTH_KEEPALIVE_SIZE) {
            uint32_t advertised, nonce, counter;
            memcpy(&advertised, data + 1, 4);
            memcpy(&nonce, data + 5, 4);
            memcpy(&counter, data + 9, 4);
            if (advertised != 0 &&
                ESPNowCrypto::acceptReplay(peer.rx_nonce,
                                           peer.rx_replay,
                                           nonce,
                                           counter,
                                           (uint32_t)millis())) {
                peer.tx_peer_nonce.store(advertised, std::memory_order_release);
                peer.tx_peer_known.store(true, std::memory_order_release);
                accepted = true;
                authenticated = true;
            }
        } else if (len == 5) {
            uint32_t advertised;
            memcpy(&advertised, data + 1, 4);
            if (advertised != 0) {
                bool new_session =
                    !peer.tx_peer_known.load(std::memory_order_acquire) ||
                    peer.tx_peer_nonce.load(std::memory_order_acquire) != advertised;
                session_reset =
                    new_session &&
                    peer.session_state.load(std::memory_order_acquire) ==
                    PeerSessionState::Connected;
                peer.tx_peer_nonce.store(advertised, std::memory_order_release);
                peer.tx_peer_known.store(true, std::memory_order_release);
                if (new_session) {
                    peer.session_state.store(
                        PeerSessionState::Synchronizing, std::memory_order_release);
                    peer.tx_counter.store(0, std::memory_order_release);
                    peer.last_rx_ms.store(0, std::memory_order_release);
                    peer.last_control_ms.store(0, std::memory_order_release);
                    ESPNowCrypto::issueRxChallenge(peer.rx_nonce);
                    peer.rx_replay = {};
                    peer.motion_barrier_counter = 0;
                }
                accepted = true;
            }
        }

        if (!accepted) {
            return;
        }

        if (authenticated) {
            became_authenticated =
                notePeerAuthenticatedLocked(
                    peer_index, false, (uint32_t)millis());
        }
        peer.echo_pending.store(true, std::memory_order_release);
    }

    if (became_authenticated || session_reset) {
        refreshReportInterval();
    }
}

void ESPNowChannel::handleData(int peer_index, const uint8_t* data, int len) {
    if (len < FRAG_HDR_SIZE) {
        return;
    }

    uint8_t seq         = data[9];
    uint8_t frag_idx    = data[10];
    uint8_t total_frags = data[11];
    size_t  payload_len = (size_t)(len - FRAG_HDR_SIZE);
    if (total_frags == 0 || total_frags > MAX_FRAGS ||
        frag_idx >= total_frags || payload_len > MAX_FRAG_DATA) {
        return;
    }

    PeerStateLock peer_lock(_peer_mutex);
    if (!peer_lock.locked()) {
        return;
    }

    size_t paired_count = _paired_count.load(std::memory_order_acquire);
    if (peer_index < 0 || peer_index >= (int)paired_count) {
        return;
    }

    auto& peer = _paired_peers[peer_index];

    uint32_t nonce, counter;
    memcpy(&nonce,   data + 1, 4);
    memcpy(&counter, data + 5, 4);
    if (!ESPNowCrypto::acceptReplay(peer.rx_nonce, peer.rx_replay, nonce, counter, (uint32_t)millis())) {
        return;  // replay / stale ->> drop
    }
    if (counter <= peer.motion_barrier_counter) {
        return;
    }
    uint32_t now = (uint32_t)millis();
    if (notePeerAuthenticatedLocked(peer_index, false, now)) {
        refreshReportInterval();
    }

    // Reassembly scratch is allocated on first inbound data from this peer and
    // held until it disconnects (freeFrag via resetPeerRuntimeLocked / flushRx).
    if (!peer.frag) {
        peer.frag = static_cast<FragBuf*>(calloc(1, sizeof(FragBuf)));
        if (!peer.frag) {
            log_error("ESP-NOW: failed to allocate reassembly buffer");
            return;
        }
    }
    FragBuf& frag = *peer.frag;

    // Expire stale reassembly window before accepting a new sequence
    if (frag.active) {
        bool stale_seq     = (frag.seq != seq);
        bool stale_timeout = ((uint32_t)(millis() - frag.start_ms)
                              > FRAG_REASSEMBLY_TIMEOUT_MS);
        if (stale_seq || stale_timeout) {
            memset(&frag, 0, sizeof(frag));
        }
    }

    if (!frag.active) {
        frag.seq      = seq;
        frag.total    = total_frags;
        frag.active   = true;
        frag.start_ms = (uint32_t)millis();
        frag.received = 0;
        memset(frag.sizes, 0, sizeof(frag.sizes));
    }

    if (frag.total != total_frags) {
        return;
    }

    memcpy(frag.data[frag_idx], data + FRAG_HDR_SIZE, payload_len);
    frag.sizes[frag_idx]  = (uint16_t)payload_len;
    frag.received        |= (1u << frag_idx);

    // Check whether all fragments received
    uint8_t full_mask = (uint8_t)((1u << total_frags) - 1u);
    if ((frag.received & full_mask) != full_mask) {
        return;
    }

    bool claims_control = dataMessageClaimsControl(peer);
    if (claims_control && !claimControlLeaseLocked(peer_index, now, true)) {
        return;
    }
    if (claims_control &&
        notePeerAuthenticatedLocked(peer_index, true, now)) {
        refreshReportInterval();
    }

    size_t reassembled_size = 0;
    for (uint8_t i = 0; i < total_frags; ++i) {
        reassembled_size += frag.sizes[i];
    }
    bool append_newline =
        frag.sizes[total_frags - 1] == 0 ||
        frag.data[total_frags - 1][frag.sizes[total_frags - 1] - 1] != '\n';

    // Preserve msg boundaries.  The ring is allocated here, on the first
    // message that actually needs to reach the line parser.
    if (!ensureRxBuf() ||
        reassembled_size + (append_newline ? 1 : 0) > rxFree()) {
        frag.active = false;
        return;
    }

    // Reassembly complete — push the whole message into the bounded ring.
    for (uint8_t i = 0; i < total_frags; i++) {
        for (uint16_t j = 0; j < frag.sizes[i]; j++) {
            rxPush(frag.data[i][j]);
        }
    }

    if (append_newline) {
        rxPush('\n');
    }

    frag.active = false;
}


void ESPNowChannel::handleRealtime(int peer_index, const uint8_t* data, int len) {
    if (len < 1 + ART_TAG_SIZE + 1) {
        return;
    }

    uint8_t command_byte = data[1 + ART_TAG_SIZE];
    if (!is_realtime_command(command_byte)) {
        return;
    }

