bdring/FluidNC/FluidNC/esp32/ESPNow/ESPNowChannel.cpp
    Cmd command = static_cast<Cmd>(command_byte);
    bool flush_rx         = false;
    bool refresh_interval = false;

    {
        PeerStateLock peer_lock(_peer_mutex);
        if (!peer_lock.locked()) {
            return;
        }

        size_t paired_count = _paired_count.load(std::memory_order_acquire);
        if (peer_index < 0 || peer_index >= (int)paired_count) {
            return;
        }

        auto& peer = _paired_peers[peer_index];
        uint32_t nonce, counter;
        memcpy(&nonce,   data + 1, 4);
        memcpy(&counter, data + 5, 4);
        if (!ESPNowCrypto::acceptReplay(peer.rx_nonce, peer.rx_replay, nonce, counter, (uint32_t)millis())) {
            return;  // replay / stale ->>> drop
        }
        if (espnowRealtimeIsSafety(command)) {
            if (counter > peer.motion_barrier_counter) {
                peer.motion_barrier_counter = counter;
            }
            flush_rx = command == Cmd::JogCancel;
        }
        uint32_t now = (uint32_t)millis();
        bool claims_control = espnowRealtimeClaimsControl(command);
        if (claims_control && !claimControlLeaseLocked(peer_index, now)) {
            return;
        }
        refresh_interval = notePeerAuthenticatedLocked(peer_index, claims_control, now);
    }

    // Do not run command handlers while holding the peer-state mutex.  In
    // particular, JogCancel flushes receive state and takes that mutex again.
    if (flush_rx) {
        flushRx();
    }
    if (refresh_interval) {
        refreshReportInterval();
    }
    Channel::push(command_byte);
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
void ESPNowChannel::onSent(const esp_now_send_info_t* tx_info, esp_now_send_status_t status) {
    if (!tx_info) {
        return;
    }
    handleSent(tx_info->des_addr, status);
}
#else
void ESPNowChannel::onSent(const uint8_t* mac, esp_now_send_status_t status) {
    handleSent(mac, status);
}
#endif

void ESPNowChannel::handleSent(const uint8_t* mac, esp_now_send_status_t status) {
    if (!_instance || !mac) {
        return;
    }

    if (_instance->_pairing_challenge_waiting.load(std::memory_order_acquire) &&
        memcmp(mac, _instance->_pairing_callback_mac, 6) == 0) {
        _instance->_pairing_challenge_waiting.store(false, std::memory_order_release);
        return;
    }

    (void)status;
}
